Test/app/views/articles/show.html.erb

        <ul id="comentarios-box">
            <% @article.comentarios.each do |comentario| %>
---
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`article_id` = 1