Test/app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
    def index
        #Obtiene todos los registros de la base
        @articles = Article.all

UPDATE `articles` SET `visita` = 1, `updated_at` = '2017-01-17 03:53:40' WHERE `articles`.`id` = 7
---
    def show
        #Obtiene el registro por un id especificado
       # @article= Article.find(params[:id])
        #Where
        #Article.where("id=? AND titulo= ?", params[:id], params[:titulo])
        @article.update_visita

INSERT INTO `articles` (`titulo`, `cuerpo`, `visita`, `created_at`, `updated_at`, `user_id`) VALUES ('Artículo con 0 visitas', 'Aqui esta el artículos que se creo sin ninguna visita aun', 0, '2017-01-17 03:43:47', '2017-01-17 03:43:47', 1)
---
    def create
        @article= current_user.articles.new(article_params);
        if @article.save

UPDATE `articles` SET `cuerpo` = 'OK este articulo fue modificado', `updated_at` = '2017-01-15 23:13:25' WHERE `articles`.`id` = 2
---
    def update
        #@article.update_attributes({title: 'Nuevo titulo'})
       # @article= Article.find(params[:id])
        if @article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 4
---
    def destroy
        #@article= Article.find(params[:id])
        @article.destroy #Destroy elmina el objeto de la BBBDD