Test/app/controllers/comentarios_controller.rb

  def create
    @comentario = current_user.comentarios.new(comentario_params)
    @comentario.article =@article
    respond_to do |format|
      if @comentario.save
---
INSERT INTO `comentarios` (`user_id`, `article_id`, `cuerpo`, `created_at`, `updated_at`) VALUES (1, 1, 'Mi primer comentario', '2017-01-17 05:18:34', '2017-01-17 05:18:34')

  def set_article
      @article= Article.find(params[:article_id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1